---
kind: type
id: T:Autodesk.Revit.DB.FamilySizeTableErrorType
source: html/daca2b01-2286-87d3-ada3-621c792b2cf4.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorType

The set of errors that can be returned when importing a FamilySizeTable from a CSV file.

## Syntax (C#)
```csharp
public enum FamilySizeTableErrorType
```